/** 
 * Copyright: Copyright (c)2015
 * Company: 云宝金服
 */
package com.zbjdl.common.amount;

/**
 * 币种枚举
 * 
 * @version:
 */
public enum CurrencyEnum {
	/**
	 * 阿联酋迪拉姆
	 **/
	AED("阿联酋迪拉姆", 2),

	/**
	 * 阿尔巴尼亚列克
	 **/
	ALL("阿尔巴尼亚列克", 2),

	/**
	 * 列斯荷兰盾
	 **/
	ANG("列斯荷兰盾", 2),

	/**
	 * 阿根廷比索
	 **/
	ARS("阿根廷比索", 2),

	/**
	 * 奥地利先令
	 **/
	ATS("奥地利先令", 2),

	/**
	 * 澳元
	 **/
	AUD("澳元", 2),

	/**
	 * 阿鲁巴岛弗罗林
	 **/
	AWG("阿鲁巴岛弗罗林", 2),

	/**
	 * 巴巴多斯元
	 **/
	BBD("巴巴多斯元", 2),

	/**
	 * 孟加拉塔卡
	 **/
	BDT("孟加拉塔卡", 2),

	/**
	 * 保加利亚列瓦
	 **/
	BGN("保加利亚列瓦", 2),

	/**
	 * 巴林第纳尔
	 **/
	BHD("巴林第纳尔", 2),

	/**
	 * 布隆迪法郎
	 **/
	BIF("布隆迪法郎", 2),

	/**
	 * 百慕大元
	 **/
	BMD("百慕大元", 2),

	/**
	 * 文莱元
	 **/
	BND("文莱元", 2),

	/**
	 * 玻利维亚诺
	 **/
	BOB("玻利维亚诺", 2),

	/**
	 * 巴西里亚伊
	 **/
	BRL("巴西里亚伊", 2),

	/**
	 * 巴哈马元
	 **/
	BSD("巴哈马元", 2),

	/**
	 * 不丹卢比
	 **/
	BTN("不丹卢比", 2),

	/**
	 * 博茨瓦纳普拉
	 **/
	BWP("博茨瓦纳普拉", 2),

	/**
	 * 白俄罗斯卢布
	 **/
	BYR("白俄罗斯卢布", 2),

	/**
	 * 伯利兹元
	 **/
	BZD("伯利兹元", 2),

	/**
	 * 加拿大元
	 **/
	CAD("加拿大元", 2),

	/**
	 * 瑞士法郎
	 **/
	CHF("瑞士法郎", 2),

	/**
	 * 智利比索
	 **/
	CLP("智利比索", 2),
	
	/**
	 * 人民币
	 **/
	CNY("人民币", 2),

	/**
	 * 哥伦比亚比索
	 **/
	COP("哥伦比亚比索", 2),

	/**
	 * 哥斯达黎加科朗
	 **/
	CRC("哥斯达黎加科朗", 2),

	/**
	 * 古巴比索
	 **/
	CUP("古巴比索", 2),

	/**
	 * 佛得角埃斯库多
	 **/
	CVE("佛得角埃斯库多", 2),

	/**
	 * 捷克克朗
	 **/
	CZK("捷克克朗", 2),

	/**
	 * 吉布提法郎
	 **/
	DJF("吉布提法郎", 2),

	/**
	 * 丹麦克朗
	 **/
	DKK("丹麦克朗", 2),

	/**
	 * 多米尼加比索
	 **/
	DOP("多米尼加比索", 2),

	/**
	 * 阿尔及利亚第纳尔
	 **/
	DZD("阿尔及利亚第纳尔", 2),

	/**
	 * 苏克雷
	 **/
	ECS("苏克雷", 2),

	/**
	 * 埃及镑
	 **/
	EGP("埃及镑", 2),

	/**
	 * 埃塞俄比亚比尔
	 **/
	ETB("埃塞俄比亚比尔", 2),

	/**
	 * 比塞塔
	 **/
	ESP("比塞塔", 2),

	/**
	 * 欧元
	 **/
	EUR("欧元", 2),

	/**
	 * 芬兰马克
	 **/
	FIM("芬兰马克", 2),

	/**
	 * 斐济元
	 **/
	FJD("斐济元", 2),

	/**
	 * 福克兰群岛镑
	 **/
	FKP("福克兰群岛镑", 2),

	/**
	 * 英镑
	 **/
	GBP("英镑", 2),

	/**
	 * 直布罗陀镑
	 **/
	GIP("直布罗陀镑", 2),

	/**
	 * 冈比亚达拉西
	 **/
	GMD("冈比亚达拉西", 2),

	/**
	 * 几内亚法郎
	 **/
	GNF("几内亚法郎", 2),

	/**
	 * 危地马拉格查尔
	 **/
	GTQ("危地马拉格查尔", 2),

	/**
	 * 圭亚那元
	 **/
	GYD("圭亚那元", 2),

	/**
	 * 港元
	 **/
	HKD("港元", 2),

	/**
	 * 洪都拉斯伦皮拉
	 **/
	HNL("洪都拉斯伦皮拉", 2),

	/**
	 * 克罗地亚库纳
	 **/
	HRK("克罗地亚库纳", 2),

	/**
	 * 海地古德
	 **/
	HTG("海地古德", 2),

	/**
	 * 匈牙利福林
	 **/
	HUF("匈牙利福林", 2),

	/**
	 * 印度尼西亚卢比(盾)
	 **/
	IDR("印度尼西亚卢比(盾)", 2),

	/**
	 * 以色列镑
	 **/
	ILS("以色列镑", 2),

	/**
	 * 印度卢比
	 **/
	INR("印度卢比", 2),

	/**
	 * 伊拉克第纳尔
	 **/
	IQD("伊拉克第纳尔", 2),

	/**
	 * 伊朗里亚尔
	 **/
	IRR("伊朗里亚尔", 2),

	/**
	 * 冰岛克朗
	 **/
	ISK("冰岛克朗", 2),

	/**
	 * 牙买加元
	 **/
	JMD("牙买加元", 2),

	/**
	 * 约旦第纳尔
	 **/
	JOD("约旦第纳尔", 2),

	/**
	 * 日元
	 **/
	JPY("日元", 2),

	/**
	 * 肯尼亚先令
	 **/
	KES("肯尼亚先令", 2),

	/**
	 * 柬埔寨利尔斯
	 **/
	KHR("柬埔寨利尔斯", 2),

	/**
	 * 科摩罗法郎
	 **/
	KMF("科摩罗法郎", 2),

	/**
	 * 朝鲜圆
	 **/
	KPW("朝鲜圆", 2),

	/**
	 * 韩元
	 **/
	KRW("韩元", 2),

	/**
	 * 科威特第纳尔
	 **/
	KWD("科威特第纳尔", 2),

	/**
	 * 哈萨克斯坦腾格
	 **/
	KZT("哈萨克斯坦腾格", 2),

	/**
	 * 老挝基普
	 **/
	LAK("老挝基普", 2),

	/**
	 * 黎巴嫩镑
	 **/
	LBP("黎巴嫩镑", 2),

	/**
	 * 斯里兰卡卢比
	 **/
	LKR("斯里兰卡卢比", 2),

	/**
	 * 利比里亚元
	 **/
	LRD("利比里亚元", 2),

	/**
	 * 莱索托洛提
	 **/
	LSL("莱索托洛提", 2),

	/**
	 * 立陶宛里塔斯
	 **/
	LTL("立陶宛里塔斯", 2),

	/**
	 * 拉脱维亚拉图
	 **/
	LVL("拉脱维亚拉图", 2),

	/**
	 * 利比亚第纳尔
	 **/
	LYD("利比亚第纳尔", 2),

	/**
	 * 摩洛哥道拉姆
	 **/
	MAD("摩洛哥道拉姆", 2),

	/**
	 * 摩尔多瓦列伊
	 **/
	MDL("摩尔多瓦列伊", 2),

	/**
	 * 马其顿第纳尔
	 **/
	MKD("马其顿第纳尔", 2),

	/**
	 * 缅甸元
	 **/
	MMK("缅甸元", 2),

	/**
	 * 蒙古图格里克
	 **/
	MNT("蒙古图格里克", 2),

	/**
	 * 澳门元
	 **/
	MOP("澳门元", 2),

	/**
	 * 毛里塔尼亚乌吉亚
	 **/
	MRO("毛里塔尼亚乌吉亚", 2),

	/**
	 * 毛里求斯卢比
	 **/
	MUR("毛里求斯卢比", 2),

	/**
	 * 马尔代夫卢非亚
	 **/
	MVR("马尔代夫卢非亚", 2),

	/**
	 * 马拉维克瓦查
	 **/
	MWK("马拉维克瓦查", 2),

	/**
	 * 墨西哥比索
	 **/
	MXN("墨西哥比索", 2),

	/**
	 * 马来西亚林吉特
	 **/
	MYR("马来西亚林吉特", 2),

	/**
	 * 纳米比亚元
	 **/
	NAD("纳米比亚元", 2),

	/**
	 * 尼日利亚奈拉
	 **/
	NGN("尼日利亚奈拉", 2),

	/**
	 * 尼加拉瓜科多巴
	 **/
	NIO("尼加拉瓜科多巴", 2),

	/**
	 * 挪威克朗
	 **/
	NOK("挪威克朗", 2),

	/**
	 * 尼泊尔卢比
	 **/
	NPR("尼泊尔卢比", 2),

	/**
	 * 新西兰元
	 **/
	NZD("新西兰元", 2),

	/**
	 * 阿曼里亚尔
	 **/
	OMR("阿曼里亚尔", 2),

	/**
	 * 巴拿马巴尔博亚
	 **/
	PAB("巴拿马巴尔博亚", 2),

	/**
	 * 秘鲁索尔
	 **/
	PEN("秘鲁索尔", 2),

	/**
	 * 巴布亚新几内亚基那
	 **/
	PGK("巴布亚新几内亚基那", 2),

	/**
	 * 菲律宾比索
	 **/
	PHP("菲律宾比索", 2),

	/**
	 * 巴基斯坦卢比
	 **/
	PKR("巴基斯坦卢比", 2),

	/**
	 * 波兰兹罗提
	 **/
	PLN("波兰兹罗提", 2),

	/**
	 * 巴拉圭瓜拉尼
	 **/
	PYG("巴拉圭瓜拉尼", 2),

	/**
	 * 卡塔尔利尔
	 **/
	QAR("卡塔尔利尔", 2),

	/**
	 * 罗马尼亚新列伊
	 **/
	RON("罗马尼亚新列伊", 2),

	/**
	 * 俄罗斯卢布
	 **/
	RUB("俄罗斯卢布", 2),

	/**
	 * 卢旺达法郎
	 **/
	RWF("卢旺达法郎", 2),

	/**
	 * 沙特阿拉伯里亚尔
	 **/
	SAR("沙特阿拉伯里亚尔", 2),

	/**
	 * 所罗门群岛元
	 **/
	SBD("所罗门群岛元", 2),

	/**
	 * 塞舌尔法郎
	 **/
	SCR("塞舌尔法郎", 2),

	/**
	 * 瑞典克朗
	 **/
	SEK("瑞典克朗", 2),

	/**
	 * 新加坡元
	 **/
	SGD("新加坡元", 2),

	/**
	 * 圣赫勒拿群岛磅
	 **/
	SHP("圣赫勒拿群岛磅", 2),

	/**
	 * 塞拉利昂利昂
	 **/
	SLL("塞拉利昂利昂", 2),

	/**
	 * 索马里先令
	 **/
	SOS("索马里先令", 2),

	/**
	 * 圣多美多布拉
	 **/
	STD("圣多美多布拉", 2),

	/**
	 * 萨尔瓦多科朗
	 **/
	SVC("萨尔瓦多科朗", 2),

	/**
	 * 叙利亚镑
	 **/
	SYP("叙利亚镑", 2),

	/**
	 * 斯威士兰里兰吉尼
	 **/
	SZL("斯威士兰里兰吉尼", 2),

	/**
	 * 泰国铢
	 **/
	THB("泰国铢", 2),

	/**
	 * 突尼斯第纳尔
	 **/
	TND("突尼斯第纳尔", 2),

	/**
	 * 汤加潘加
	 **/
	TOP("汤加潘加", 2),

	/**
	 * 土耳其新里拉
	 **/
	TRY("土耳其新里拉", 2),

	/**
	 * 特立尼达和多巴哥元
	 **/
	TTD("特立尼达和多巴哥元", 2),

	/**
	 * 台币
	 **/
	TWD("台币", 2),

	/**
	 * 坦桑尼亚先令
	 **/
	TZS("坦桑尼亚先令", 2),

	/**
	 * 乌克兰赫夫米
	 **/
	UAH("乌克兰赫夫米", 2),

	/**
	 * 美元
	 **/
	USD("美元", 2),

	/**
	 * 乌拉圭新比索
	 **/
	UYU("乌拉圭新比索", 2),

	/**
	 * 越南盾
	 **/
	VND("越南盾", 2),

	/**
	 * 瓦努阿图瓦图
	 **/
	VUV("瓦努阿图瓦图", 2),

	/**
	 * 萨摩亚塔拉
	 **/
	WST("萨摩亚塔拉", 2),

	/**
	 * 刚果中非共同体法郎
	 **/
	XAF("刚果中非共同体法郎", 2),

	/**
	 * 银价盎司
	 **/
	XAG("银价盎司", 2),

	/**
	 * 金价盎司
	 **/
	XAU("金价盎司", 2),

	/**
	 * 格林纳达东加勒比元
	 **/
	XCD("格林纳达东加勒比元", 2),

	/**
	 * 铜价盎司
	 **/
	XCP("铜价盎司", 2),

	/**
	 * 多哥非洲共同体法郎
	 **/
	XOF("多哥非洲共同体法郎", 2),

	/**
	 * 钯价盎司
	 **/
	XPD("钯价盎司", 2),

	/**
	 * 太平洋法郎
	 **/
	XPF("太平洋法郎", 2),

	/**
	 * 铂价盎司
	 **/
	XPT("铂价盎司", 2),

	/**
	 * 也门里亚尔
	 **/
	YER("也门里亚尔", 2),

	/**
	 * 南非兰特
	 **/
	ZAR("南非兰特", 2),

	/**
	 * 赞比亚克瓦查
	 **/
	ZMK("赞比亚克瓦查", 2),

	/**
	 * 扎伊尔
	 **/
	ZRZ("扎伊尔", 2),

	/**
	 * 津巴布韦元
	 **/
	ZWD("津巴布韦元", 2);

	/**
	 * 单位
	 */
	private String unit;

	/**
	 * 精度
	 */
	private int accuracy;

	private CurrencyEnum(String unit, int accuracy) {
		this.unit = unit;
		this.accuracy = accuracy;
	}

	public String getUnit() {
		return unit;
	}

	public int getAccuracy() {
		return accuracy;
	}

}
